import time
import os
import multiprocessing


# ------------------多进程的数据传递:multiprocessing.Queue()----------------
def producer(xx):
    for i in range(100):
        print("+++{}  生产了1个面包，编号{}".format(os.getpid(), i))
        xx.put("香甜{}号".format(i))
        time.sleep(0.1)
    return

def consumer(xx):
    for i in range(100):
        print("---{}  购买了1个面包，编号:{}".format(os.getpid(), xx.get()))
        time.sleep(0.3)
    return
    




if __name__ == "__main__":
    print("主进程pid={}".format(os.getpid()))
    q = multiprocessing.Queue()
    process1 = multiprocessing.Process(target=producer, args=(q,), name="工厂")
    process2 = multiprocessing.Process(target=consumer, args=(q,), name="面包店11")
    process3 = multiprocessing.Process(target=consumer, args=(q,), name="面包店22")

    process1.start()
    process2.start()
    process3.start()
    
    
    
'''  
主进程pid=18857
+++18861  生产了1个面包，编号0
---18863  购买了1个面包，编号:香甜0号
+++18861  生产了1个面包，编号1
---18862  购买了1个面包，编号:香甜1号
+++18861  生产了1个面包，编号2
---18863  购买了1个面包，编号:香甜2号
+++18861  生产了1个面包，编号3
---18862  购买了1个面包，编号:香甜3号
+++18861  生产了1个面包，编号4
+++18861  生产了1个面包，编号5
---18863  购买了1个面包，编号:香甜4号
+++18861  生产了1个面包，编号6
---18862  购买了1个面包，编号:香甜5号
+++18861  生产了1个面包，编号7
+++18861  生产了1个面包，编号8
---18863  购买了1个面包，编号:香甜6号
+++18861  生产了1个面包，编号9
---18862  购买了1个面包，编号:香甜7号
+++18861  生产了1个面包，编号10
+++18861  生产了1个面包，编号11
---18863  购买了1个面包，编号:香甜8号
+++18861  生产了1个面包，编号12
---18862  购买了1个面包，编号:香甜9号
+++18861  生产了1个面包，编号13
+++18861  生产了1个面包，编号14
---18863  购买了1个面包，编号:香甜10号
+++18861  生产了1个面包，编号15
---18862  购买了1个面包，编号:香甜11号
+++18861  生产了1个面包，编号16
+++18861  生产了1个面包，编号17
---18863  购买了1个面包，编号:香甜12号
+++18861  生产了1个面包，编号18
---18862  购买了1个面包，编号:香甜13号
+++18861  生产了1个面包，编号19
+++18861  生产了1个面包，编号20
---18863  购买了1个面包，编号:香甜14号
.......
.......
'''
